#include "led.h"
#include "beep.h"
#include "key.h"
#include "MQ-2.h"
#include "fire.h"

/**************************************************************************
功能描述：传感器驱动
入口参数：无
返回值：无
 *************************************************************************/
void beep_heartbeat(void)
{
	/*
	if (key_state && (MQ2_state || fire_state)){		// 当（xx）超过一定值，且启动报警状态。
		Sensor_OUT = 0;          //蜂鸣器不鸣响
	} else{
		Sensor_OUT = 1;          //蜂鸣器鸣响
	}
	*/

	if (1){
	 	Sensor_OUT = 1;          //蜂鸣器鸣响
		led_on(LED_3);	         //点亮用户指示灯D3
		delay_ms(1000);          //延时1S，方便观察实验现象
		
		Sensor_OUT = 0;          //蜂鸣器不鸣响
		led_off(LED_3);	         //熄灭用户指示灯D3
		delay_ms(1000);          //延时1S，方便观察实验现象


	}

}

/*********************************END FILE********************************************/	

