#include "led.h"
#include "MQ-2.h"
#include "fire.h"	

uint8 fire_state;

/**************************************************************************
功能描述：传感器检测
入口参数：无
返回值：无
 *************************************************************************/
void fire_heartbeat(void)
{
	 if(Sensor_IN2 == 0)        //MQ-2传感器感应到可燃性气体浓度达到一定值，DO针脚输出低电平      
	 {
		 fire_state = 1;
		 led_on(LED_3);	         //点亮用户指示灯D3
	 }
	 else                      //MQ-2传感器感应到可燃性气体浓度低于一定值，DO针脚输出高电平 
	 {
		 fire_state = 0;
		 led_off(LED_3);	       //熄灭用户指示灯D3
	 }
}

/*********************************END FILE********************************************/	

