#include "led.h"
#include "key.h"	

uint8 key_state = 1;

/**************************************************************************
功能描述：触摸按键检测
入口参数：无
返回值：无
 *************************************************************************/
void KEY_Scan(void)
{
	 if(TOUCH_KEY == 1)           //检测触摸按键用引脚P5.4是否是高电平 (用手指触摸按键感应区域，引脚为高电平)
	 {
		 key_state = ~key_state;		// ques: 按键被按下过。
	    delay_ms(10);             //软件延时10ms，软件消抖
	    if(TOUCH_KEY== 1)	        //检测触摸按键用引脚P5.4是否依然是高电平
	    {
				led_on(LED_3);	        //点亮用户指示灯D3
		    while(TOUCH_KEY == 1)   //等待触摸按键释放，即如果P5.4一直为高电平，会一直执行空命令
				{
					;                     //条件TOUCH_KEY == 1成立，会执行这个空命令
				}
        led_off(LED_3);	        //触摸按键释放，熄灭用户指示灯D3
	    }
	 }
}

/*********************************END FILE********************************************/	

