
#include "led.h"	

 /**************************************************************************
功能描述：点亮一个指定的指示灯(D1、D2、D3、D4)
入口参数：uint8 led_idx  (可取值LED_1、LED_2、LED_3、LED_4)
返回值：无
 *************************************************************************/
void led_on(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_D1=0;	       //控制P2.6端口输出低电平，点亮用户指示灯D1
		  break;		
		case LED_2:
      LED_D2=0;        //控制P2.7端口输出低电平，点亮用户指示灯D2
		  break;
		case LED_3:
      LED_D3=0;	       //控制P7.2端口输出低电平，点亮用户指示灯D3
		  break;		
		case LED_4:
      LED_D4=0;        //控制P7.1端口输出低电平，点亮用户指示灯D4
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：熄灭一个指定的指示灯(D1、D2、D3、D4)
入口参数：uint8 led_idx  (可取值LED_1、LED_2、LED_3、LED_4)
返回值：无
 *************************************************************************/
void led_off(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_D1=1;	       //控制P2.6端口输出高电平，熄灭用户指示灯D1
		  break;		
		case LED_2:
      LED_D2=1;        //控制P2.7端口输出高电平，熄灭用户指示灯D2
		  break;
		case LED_3:
      LED_D3=1;	       //控制P7.2端口输出高电平，熄灭用户指示灯D3
		  break;		
		case LED_4:
      LED_D4=1;        //控制P7.1端口输出高电平，熄灭用户指示灯D4
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：翻转一个指定的指示灯(D1、D2、D3、D4)
入口参数：uint8 led_idx  (可取值LED_1、LED_2、LED_3、LED_4)
返回值：无
*************************************************************************/
void led_toggle(uint8 led_idx)
{
  switch(led_idx)
	{
		case LED_1:
      LED_D1=~LED_D1;	   //控制P2.6端口输出不同于上一次的电平，翻转用户指示灯D1
		  break;		
		case LED_2:
      LED_D2=~LED_D2;    //控制P2.7端口输出不同于上一次的电平，翻转用户指示灯D2
		  break;
		case LED_3:
      LED_D3=~LED_D3;	   //控制P7.2端口输出不同于上一次的电平，翻转用户指示灯D3
		  break;		
		case LED_4:
      LED_D4=~LED_D4;    //控制P7.1端口输出不同于上一次的电平，翻转用户指示灯D4
		  break;
		default:
		  break;
  }
}

/**************************************************************************
功能描述：点亮开发板上的4个指示灯(D1、D2、D3、D4)
入口参数：无
返回值：无
 *************************************************************************/
void leds_on(void)
{
		LED_D1=0;	       //控制P2.6端口输出低电平，点亮用户指示灯D1
		LED_D2=0;        //控制P2.7端口输出低电平，点亮用户指示灯D2
	  LED_D3=0;        //控制P7.2端口输出低电平，点亮用户指示灯D3
	  LED_D4=0;        //控制P7.1端口输出低电平，点亮用户指示灯D4
}

/**************************************************************************
功能描述：熄灭开发板上的4个指示灯(D1、D2、D3、D4)
入口参数：无
返回值：无
 *************************************************************************/
void leds_off(void)
{
		LED_D1=1;	       //控制P2.6端口输出高电平，熄灭用户指示灯D1
		LED_D2=1;        //控制P2.7端口输出高电平，熄灭用户指示灯D2
	  LED_D3=1;        //控制P7.2端口输出高电平，熄灭用户指示灯D3
	  LED_D4=1;        //控制P7.1端口输出高电平，熄灭用户指示灯D4
}

/**************************************************************************
功能描述：流水灯
入口参数：无
返回值：无
 *************************************************************************/
void LED_Blink(void)
{
		leds_off();	          //熄灭所有用户指示灯
		led_on(LED_1);        //点亮用户指示灯D1
		delay_ms(300);
		leds_off();	          //熄灭所有用户指示灯
		led_on(LED_2);        //点亮用户指示灯D2
		delay_ms(300);
		leds_off();	          //熄灭所有用户指示灯
		led_on(LED_3);        //点亮用户指示灯D3
		delay_ms(300);
		leds_off();	          //熄灭所有用户指示灯
		led_on(LED_4);        //点亮用户指示灯D4
		delay_ms(300);
		leds_off();	          //熄灭所有用户指示灯
		delay_ms(300);
}

/*********************************END FILE********************************************/	

